jaxws21/modules/saaj/test-resources/soap-part3.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header>
<ns-prefix:Header1 xmlns:ns-prefix="ns-uri" soapenv:mustUnderstand="1">This is Header1</ns-prefix:Header1>
<ns-prefix:Header2 xmlns:ns-prefix="ns-uri" soapenv:mustUnderstand="0">This is Header2</ns-prefix:Header2>
<ns-prefix:Header3 xmlns:ns-prefix="ns-uri" soapenv:mustUnderstand="1">This is Header3</ns-prefix:Header3>
<ns-prefix:Header4 xmlns:ns-prefix="ns-uri" soapenv:mustUnderstand="0">This is Header4</ns-prefix:Header4>
</soapenv:Header>
<soapenv:Body>
<ns-prefix:Body1 xmlns:ns-prefix="ns-uri">
<ns-prefix:Child1>This is Child1</ns-prefix:Child1>
<ns-prefix:Child2>This is Child2</ns-prefix:Child2>
</ns-prefix:Body1>
</soapenv:Body>
</soapenv:Envelope>